# AnalyticalPhysicalCheckDone Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalPhysicalCheckDone Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analytical / Physical Model Consistency check is complete.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalPhysicalCheckDone { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalPhysicalCheckDone As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalPhysicalCheckDone {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace